Repository: LaserSrl/CloudConstruct
Catalog: src/Modules/CloudConstruct.SecureFileField/App_Data/Localization/*/orchard.module.po
Languages: it_it

source: Allow only specific extensions
it_it: Permetti solo estensioni specifiche

source: Blob Account Name
it_it: Nome account Blob

source: Blob Endpoint
it_it: Endpoint Blob

source: Check to encrypt the secure media while uploading it.
it_it: Seleziona per crittografare il media sicuro durante l'upload.

source: Check to ensure the file name unicity.
it_it: Seleziona per imporre di usare nomi unici per i files.

source: Check to ensure the user is providing a valid media for this field.
it_it: Seleziona per verificare che l'utente dia un media valido per questo campo.

source: Custom parameters can be used in your own views.
it_it: I parametri personalizzati possono essere utilizzati nelle tue visualizzazioni.

source: Custom subfolder. It can be a token.
it_it: Sottocartella personalizzata. Può essere un token.

source: Generate a new file name at every upload
it_it: Genera un nuovo nome file ad ogni caricamento

source: Get this from the Azure Portal.
it_it: Ottienilo dal Portale Azure.

source: Get this from the Azure Portal. Leave trailing '/'.
it_it: Ottienilo dal Portale Azure. Lascia il carattere '/' finale.

source: Help text
it_it: Testo della guida

source: If you would like to use Shared Access Signatures then specify an expiration time in minutes for your URL access.
it_it: Se vuoi usare la Firma di Accesso Condiviso, specifica la scadenza in minuti per il tuo indirizzo di accesso.

source: In case the custom subfolder textbox is left empty, files will not be sorted into subfolders.
it_it: Nel caso in cui la casella della sottocartella sia lasciata vuota, i file non verranno ordinati in sottocartelle.

source: Leave it empty if you don't want to apply any restriction.
it_it: Lascia vuoto se non vuoi imporre nessuna restrizione.

source: Leave it empty if you don't want to use this option.
it_it: Lascia vuoto se non vuoi usare questa opzione.

source: Please enter in your Windows Azure Blob Storage account name.
it_it: Inserisci il tuo nome di account per Windows Azure Blob Storage.

source: Provide custom parameters
it_it: Fornire parametri personalizzati

source: Remember that some tokens may not work if content is created via Content Creation service.
it_it: Ricorda che alcuni token potrebbero non funzionare se il contenuto viene creato tramite il servizio di Content Creation.

source: Secure Access Key
it_it: Chiave per l'Accesso Sicuro

source: Secure Directory or Container Name
it_it: Nome della cartella o del contenitore sicuro

source: Shared Access Expiration
it_it: Scadenza Accesso Condiviso

source: The endpoint for your Blob Storage.
it_it: L'endpoint del tuo Archivio Blob.

source: The help text is written under the field when authors are selecting a media.
it_it: Il testo di aiuto è scritto sotto il campo quando gli autori stanno selezionando un media.

source: The media is encrypted
it_it: Il media è crittografato

source: The media is required
it_it: Il media è necessario

source: The secret storage access key.
it_it: La chiave di accesso all'archivio segreto.

source: The secure directory/container name will be used to store your files inside. Make sure this container or folder exists prior to uploading a file. Example, 'c:\temp' or 'secure' for BLOBS.
it_it: Il nome della directory/contenitore che sarà usato per i files. Assicurati che questo contenitore o cartella esista prima di caricare i files. Esempi: 'c:\temp' o 'sicuro' per i BLOB.

source: Use Secure Blob Storage
it_it: Usa l'Archivio Sicuro Blob

source: You can define a set of extensions the user will be able to pick, separated by spaces, e.g. jpg png gif
it_it: Puoi selezionare un insieme di estensioni per i files che l'utente potrà scegliere, separate da spazio, e.g. jpg png gif

source: Browse
it_it: Sfoglia

source: Current
it_it: File attuale

# CloudConstruct.SecureFileField.Drivers.SecureFileFieldDriver
source: The field {0} is mandatory
it_it: Il campo {0} è obbligatorio

# CloudConstruct.SecureFileField.Drivers.SecureFileFieldDriver
source: The field {0} must have one of these extensions: {1}
it_it: Il campo {0} deve avere una di queste estensioni: {1}

# CloudConstruct.SecureFileField.Drivers.SecureFileFieldDriver
source: The url of the media.
it_it: L'url del file multimediale.

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: Alignment
it_it: Allineamento

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: Alternate Text
it_it: Testo alternativo

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: Class
it_it: Classe

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: Height
it_it: Altezza

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: Secure File Field
it_it: Campo di File Sicuro

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: Style
it_it: Stile

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: The alignment of the media.
it_it: L'allineamento del media.

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: The alternate text of the media.
it_it: Il testo alternativo per questo file multimediale.

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: The class of the media.
it_it: La classe del media.

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: The height of the media.
it_it: L'altezza del media.

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: The style of the media.
it_it: Lo stile del media.

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: The url of the media.
it_it: L'url del file multimediale.

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: The width of the media.
it_it: La larghezza del media.

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: Tokens for Secure File Fields
it_it: Tokens per i Campi di File Sicuri

# CloudConstruct.SecureFileField.Tokens.FieldTokens
source: Width
it_it: Larghezza

# CloudConstruct.SecureFileField.Tokens.of
source: Alignment
it_it: Allineamento

# CloudConstruct.SecureFileField.Tokens.of
source: Height
it_it: Altezza

# CloudConstruct.SecureFileField.Tokens.of
source: Style
it_it: Stile

# CloudConstruct.SecureFileField.Tokens.of
source: The alignment of the media.
it_it: L'allineamento del media.

# CloudConstruct.SecureFileField.Tokens.of
source: The height of the media.
it_it: L'altezza del media.

# CloudConstruct.SecureFileField.Tokens.of
source: The style of the media.
it_it: Lo stile del media.

# CloudConstruct.SecureFileField.Tokens.of
source: The width of the media.
it_it: La larghezza del media.

# CloudConstruct.SecureFileField.Tokens.of
source: Width
it_it: Larghezza
